In [7]:
name = 'Tom'
age = 25
print(name == age)

False

In [9]:
name + str(age)

'Tom25'

In [17]:
print(name + str(age) + str(name == age))

Tom25False

In [15]:
type(name + str(age) + str(name == age))

str

In [1]:
import pandas as pd

df1 = pd.DataFrame([(1,),(3,4),(5,6)], columns=['a','b'])

In [2]:
df2 = pd.DataFrame([(100,200),(300,),(500,600)], columns=['a','b'])

In [3]:
df_add = df1.add(df2, fill_value=0)

In [7]:
df1

   a    b
0  1  NaN
1  3  4.0
2  5  6.0

In [9]:
df2

     a      b
0  100  200.0
1  300    NaN
2  500  600.0

In [11]:
df_add

     a      b
0  101  200.0
1  303    4.0
2  505  606.0